In [1]:
import pandas as pd

In [2]:
table2 = pd.read_csv('../table2.csv')

In [3]:
table2.head()

  Country  Year   Medal  Count
0     AFG  2008  Bronze      1
1     AFG  2012  Bronze      1
2     AHO  1988  Silver      1
3     ALG  1984  Bronze      2
4     ALG  1992  Bronze      1

# Pivot() and pivot_table() is same as groupby + unstack()
## But in pivot_table() we can specify the aggfunc and fill_value and margins
### Parameters: -aggfunc: function to apply, default is mean, -fill_value: replace NaN with this value, -margins: add all and row/column totals

In [17]:
table2.pivot_table(index='Country', columns='Medal', values='Count', aggfunc='sum', fill_value=0, margins=True, 
                   margins_name='sum_medal')

Medal      Bronze   Gold  Silver  sum_medal
Country
AFG             2      0       0          2
AHO             0      0       1          1
ALG             8      5       2         15
ANZ             5     20       4         29
ARG            91     69      99        259
...           ...    ...     ...        ...
YUG           118    143     174        435
ZAM             1      0       1          2
ZIM             1     18       4         23
ZZX            10     23      15         48
sum_medal   10369  10484   10308      31161

[148 rows x 4 columns]

## Groupby + unstack()

In [9]:
agg = table2.groupby(['Country', 'Medal'])['Count'].sum().unstack(fill_value=0)

In [10]:
agg

Medal    Bronze  Gold  Silver
Country
AFG           2     0       0
AHO           0     0       1
ALG           8     5       2
ANZ           5    20       4
ARG          91    69      99
...         ...   ...     ...
VIE           0     0       2
YUG         118   143     174
ZAM           1     0       1
ZIM           1    18       4
ZZX          10    23      15

[147 rows x 3 columns]

# We can maanual add the margins

In [11]:
agg['All'] = agg.sum(axis=1)

In [12]:
agg.loc['All'] = agg.sum()

In [14]:
agg

Medal    Bronze   Gold  Silver    All
Country
AFG           2      0       0      2
AHO           0      0       1      1
ALG           8      5       2     15
ANZ           5     20       4     29
ARG          91     69      99    259
...         ...    ...     ...    ...
YUG         118    143     174    435
ZAM           1      0       1      2
ZIM           1     18       4     23
ZZX          10     23      15     48
All       10369  10484   10308  31161

[148 rows x 4 columns]